/*1951393 自动化 张儒戈*/
#include <iostream>
#include <conio.h>
using namespace std;

#define DAYS_2099_12_31		73049	//从1900-1-1到2099_12_31 的天数

/* 如果有需要的宏定义、只读全局变量等，写于此处 */

/* 如果有其它全局函数需要声明，写于此处 */

int isLeap(int year); 


/* 补全Date类的定义，所有成员函数均体外实现，不要在此处体内实现 */
class Date {
private:
	int year;
	int month;
	int day;
	/* 不允许添加数据成员 */
public:
	Date();
	Date(int y, int m, int d);
	Date(int days);
	void set(const int y, const int m = 1, const int d = 1);
	void get(int& y, int& m, int& d) const;
	void show() const;

	/* 根据需要定义所需的成员函数、友元函数等(不允许添加数据成员) */
};

/* 给出 Date 类的所有成员函数的体外实现 */
/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
Date::Date()
{
	year = 2000;
	month = 1;
	day = 1;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
Date::Date(int y, int m, int d)
{
	const int month_day[13] = { 0,31,28,31,30,31,30,31,31,30,31,30,31 };
	int isLeap_flag = 0;

	if (y > 2099 || y < 1900) {
		year = 2000;
	}
	else {
		year = y;
	}


	if (m > 12 || m < 1) {
		month = 1;
	}
	else {
		month = m;
	}


	if (month == 2) {
		isLeap_flag = isLeap(year);
	}

	if (d > month_day[month] + isLeap_flag || d < 1) {
		day = 1;
	}
	else {
		day = d;
	}
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
Date::Date(int n)
{
	const int month_day[13] = { 0,31,28,31,30,31,30,31,31,30,31,30,31 };


	day = 1;//设定当前为1日
	month = 1;//设定当前为1月
	year = 1900;//设定当前为1900年

	if (n <= 1) {
		//和默认值相同
	}
	else if (n >= 73049) {

		day = 31;
		month = 12;
		year = 2099;
	}
	else {

		while (n > 1) {
			n--;
			day++;

			//处理日的进位
			if (month == 2) {
				//如果是二月，如果大于二月天数（需判断是否为闰年），则置1，月数+1
				if (day > month_day[month] + isLeap(year)) {
					day = 1;
					month++;

				}
			}
			else {
				//如果不是二月，如果大于该月天数（不需判断是否为闰年），则置1，月数+1
				if (day > month_day[month]) {
					day = 1;
					month++;
				}
			}

			//处理月的进位
			if (month >= 13) {
				month = 1;
				year++;
			}

		}
	}

}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void Date::set(const int y, const int m, const int d)
{
	const int month_day[13] = { 0,31,28,31,30,31,30,31,31,30,31,30,31 };
	int isLeap_flag = 0;

	if (y > 2099 || y < 1900) {
		year = 2000;
	}
	else {
		year = y;
	}


	if (m > 12 || m < 1) {
		month = 1;
	}
	else {
		month = m;
	}


	if (month == 2) {
		isLeap_flag = isLeap(year);
	}

	if (d > month_day[month] + isLeap_flag || d < 1) {
		day = 1;
	}
	else {
		day = d;
	}

}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void Date::get(int& y, int& m, int& d) const
{
	y = year;
	m = month;
	d = day;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void Date::show() const
{
	cout << year << "年" << month << "月" << day << "日" << endl;
}

/* 如果有需要的其它全局函数的实现，可以写于此处 */

/***************************************************************************
  函数名称：
  功    能：判断是否为闰年
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int isLeap(int year)
{
	if (year % 4 == 0 && year % 100 != 0 || year % 400 == 0) {
		return 1;
	}
	return 0;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void wait_for_enter()
{
	cout << endl << "按回车键继续";
	while (_getch() != '\r')
		;
	cout << endl << endl;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	if (1) {
		Date d1;				//2000.1.1
		Date d2(2021, 4, 17);	//2021.4.17

		cout << "无参及三参构造函数测试（完全正确）" << endl;

		cout << "d1应该是2000.1.1， 实际为：";
		d1.show();
		cout << "d2应该是2021.4.17，实际为：";
		d2.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(1870, 3, 15);  //2000.3.15
		Date d2(2112, 3, 4);   //2000.3.4
		Date d3(2005, 13, 15); //2005.1.15
		Date d4(2021, 4, 32);  //2021.4.1

		cout << "三参构造函数测试（年、月、日非法）" << endl;

		cout << "d1应该是2000.3.15，实际为：";
		d1.show();
		cout << "d2应该是2000.3.4， 实际为：";
		d2.show();
		cout << "d3应该是2005.1.15，实际为：";
		d3.show();
		cout << "d4应该是2021.4.1， 实际为：";
		d4.show();

		/* 多个错，按年月日顺序处理 */
		Date d5(1899, 2, 29);  //2000.2.29
		Date d6(1899, 2, 30);  //2000.2.1
		Date d7(1899, 13, 31); //2000.1.31
		Date d8(1899, 13, 32); //2000.1.1
		cout << "d5应该是2000.2.29，实际为：";
		d5.show();
		cout << "d6应该是2000.2.1， 实际为：";
		d6.show();
		cout << "d7应该是2000.1.31，实际为：";
		d7.show();
		cout << "d8应该是2000.1.1， 实际为：";
		d8.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(2021, 2, 29); //2021.2.1
		Date d2(2020, 2, 29); //2020.2.29

		cout << "三参构造函数测试（闰年）" << endl;

		cout << "d1应该是2021.2.1， 实际为：";
		d1.show();
		cout << "d2应该是2020.2.29，实际为：";
		d2.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(1);          //1900.1.1
		Date d2(73049);      //2099.12.31
		Date d3(-100);       //1900.1.1
		Date d4(80000);      //2099.12.31
		Date d5(30000);      //1982.2.19
		Date d6(44302);      //2021.4.17

		cout << "一参构造函数测试，包括合法及非法值" << endl;

		cout << "d1应该是1900.1.1，  实际为：";
		d1.show();
		cout << "d2应该是2099.12.31，实际为：";
		d2.show();
		cout << "d3应该是1900.1.1，  实际为：";
		d3.show();
		cout << "d4应该是2099.12.31，实际为：";
		d4.show();
		cout << "d5应该是1982.2.19， 实际为：";
		d5.show();
		cout << "d6应该是2021.4.17， 实际为：";
		d6.show();

		wait_for_enter();
	}


	if (1) {
		Date d1, d2, d3; //都是2000.1.1

		cout << "测试set，带缺省值" << endl;
		d1.set(2021, 4, 17);	//2021.4.17
		d2.set(2021, 4);		//2021.4.1
		d3.set(2021);		//2021.1.1

		cout << "d1应该是2021.4.17，实际为：";
		d1.show();
		cout << "d2应该是2021.4.1， 实际为：";
		d2.show();
		cout << "d3应该是2021.1.1， 实际为：";
		d3.show();

		wait_for_enter();
	}

	if (1) {
		Date d1, d2, d3, d4;

		cout << "测试set，年、月、日非法" << endl;

		d1.set(2112, 2, 29);  //2000.2.29
		d2.set(2019, 2, 29);  //2019.2.1
		d3.set(2021, 5, 32);  //2021.5.1
		d4.set(2021, 13, 12); //2021.1.12

		cout << "d1应该是2000.2.29， 实际为：";
		d1.show();
		cout << "d2应该是2019.2.1，  实际为：";
		d2.show();
		cout << "d3应该是2021.5.1，  实际为：";
		d3.show();
		cout << "d4应该是2021.1.12， 实际为：";
		d4.show();

		/* 多个错+带缺省值，按年月日顺序处理 */
		Date d5(2020, 1, 31), d6(d5), d7(d5), d8(d5), d9(d5), d10(d5), d11(d5);  //2020.1.31

		d5.set(1899, 2, 29);  //2000.2.29
		d6.set(1899, 2, 30);  //2000.2.1
		d7.set(1899, 2, 0);   //2000.2.1
		d8.set(0, 2, 0);      //2020.2.1
		d9.set(0, 13, 32);    //2020.1.1
		d10.set(1899, 13, 31);  //2000.1.31
		d11.set(1899, 13, 32);  //2000.1.1
		cout << "d5应该是2000.2.29， 实际为：";
		d5.show();
		cout << "d6应该是2000.2.1，  实际为：";
		d6.show();
		cout << "d7应该是2000.2.1，  实际为：";
		d7.show();
		cout << "d8应该是2000.2.1，  实际为：";
		d8.show();
		cout << "d9应该是2000.1.1，  实际为：";
		d9.show();
		cout << "d10应该是2000.1.31，实际为：";
		d10.show();
		cout << "d11应该是2000.1.1， 实际为：";
		d11.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(2021, 4, 17);
		int y, m, d;

		cout << "测试get" << endl;
		d1.get(y, m, d);

		cout << "应该y=2021,m=4,d=17，实际为：";
		cout << "y=" << y << ",m=" << m << ",d=" << d << endl;

		wait_for_enter();
	}

	return 0;
}
