/*1951393 自动化 张儒戈*/
/*1951393 自动化 张儒戈*//* 学号 班级 姓名*/
#include <iostream>
#include <iomanip>
#include <Windows.h>
using namespace std;
extern int a;
/***************************************************************************
  函数名称：
  功    能：返回fibonacci数列的第n项的值
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/


/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不允许修改
***************************************************************************/
int main()
{
	
	return 0;
}