/* 学号 班级 姓名*/
//#include"demo.h"
#include <iostream>
#include <iomanip>
#include <Windows.h>
using namespace std;
int a;
/***************************************************************************
  函数名称：
  功    能：返回fibonacci数列的第n项的值
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/


/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不允许修改
***************************************************************************/
int demo()
{
	

	return 0;
}